about_us = """
💙Что такое OGOGO?
🎯Академия Ogogo это место, где каждый найдет себя!
🌍Мы даем возможность получить качественные знания в программировании по системе Bootcamp.
🌍Внедряем интерактивное обучение, принципами которого являются живое общение с менторами, единомышленниками и востребованными IT – специалистами.
🌍Проводим открытые уроки для тех, кто еще не определился с выбором, какой язык изучать.
🌍Наши студенты могут проводить время в уютном коворкинге в свободное время от занятий.
🔥Самые успешные и перспективные студенты получат возможность участия в проектах OGOGO.
🙌Академия OGOGO – место для вдохновения, ведь обучение должно быть еще комфортным.
Современный офис в центре города🤩, своя уютная кофейня☕️, обеденная зона для студентов🍽, мини-библиотека 📚– все это есть у нас!"""

location = """
💙Академия OGOGO
✔️Думай. ✔️Учись. ✔️Создавай.
☎️Звони ➡️➡️➡️ 0550-312-312
📍Приходи ➡️➡️➡️Ибраимова 115с"""

python = """
Python. Backend разработкa

Длительность
4 месяца           

Дополнительно    
60+ видеоуроков      

Разработка
3+ проекта

Что такое Python?

На самом деле, с Питоном всё максимально прозрачно – он простой и универсальный, поэтому может применяться для работы по многим направлениям:

Web-разработка, графический интерфейс, базы данных, системное программирование, сложные вычислительные процессы, машинное обучение, автоматизация процессов, игровая индустрия.

• веб-разработка Относительно недавно в веб-разработке стали очень популярны Python-фреймворки. Они облегчают процесс написания на языке Python кода серверной части приложений.

• Data science: машинное обучение, анализ данных визуализация. Машинное обучение — это наука о том, как заставить Искуственный Интелект учиться и действовать как человек.

• Автоматизация процессов. Hаписание небольших скриптов для автоматизации различных рабочих операций и процессов.

Программа курса:
9 основных навыков, которые вы получите на курсе

Первый месяц
1. Введение
2. Основы программирования языка Пайтон
3. Объектно-ориентированное программирование

Второй месяц
1. Базы данных
2. Тестирование
3. GIT

Третий месяц
1. FLASK
2. DJANGO, HTML-CSSk
3. REDIS(ASYNC)

Четвертый месяц
1. RESTFUL API, DJANGO REST
2. FIREBASE GOOGLE, FACEBOOK AUTH
3. Docker, Deploy
"""
java_script = """
JavaScript. Frontend разработкa

Длительность
4 месяца           

Дополнительно    
60+ видеоуроков      

Разработка
3+ проекта

Что такое JavaScript?

В первую очередь JavaScript широко используется во фронтенд-разработке. Этот язык вместе с HTML и CSS входит в базовый набор инструментов фронтендера. На JavaScript создаются приложения, которые исполняются в браузере на стороне клиента. Они обеспечивают интерактивность сайтов.

Сферы применения JavaScript не ограничиваются браузерами и веб-приложениями. С помощью этого языка решают такие задачи:

• Разработка нативных приложений. Например, с помощью фреймворка React Native создаются приложения для Android и iOS.

• Разработка десктопных приложений. JS применяется в офисных пакетах Microsoft и OpenOffice, в приложениях компании Adobe.

• Программирование оборудования и бытовой техники, например, платёжных терминалов, телевизионных приставок.

Программа курса:
9 основных навыков, которые вы получите на курсе

Первый месяц
1. Примитивные типы и переменные
2. Создание и удаление свойств объектов
3. Операторы присваивания: yнарные и бинарные

Второй месяц
1. Значения параметров функции по умолчанию
2. Массив против Объекта
3. Циклы for, do while,do, for in, for of

Третий месяц
1. Вызов fetch внутри промиса
2. Асинхронные функции
3. Обработка ошибок в асинхронных функциях

Четвертый месяц
1. TypeScript
2. WebPack
"""
ux_ui = """
UX/UI Дизайн

Длительность
2 месяца

Дополнительно
20+ видеоуроков

Разработка
3+ проекта

Что такое UI/UX дизайн?
UI-дизайн — процесс визуализации прототипа, который разработали на основании пользовательского опыта и исследования целевой аудитории. UX-дизайн — это проектирование интерфейса на основе исследований пользовательского опыта и поведения.

Разница между UX и UI — в том, что UX-дизайнер планирует, как пользователь взаимодействует с интерфейсом, какие шаги ему нужно предпринять, чтобы достичь цели. А UI-дизайнер продумывает, как эти шаги и путь к цели выглядят.

• Вы познакомитесь с ключевыми инструментами, получите представления о визуальной коммуникации и научитесь применять ее на практике, создадите работы в Figma и потренируетесь в оформлении портфолио.

• Вы получите все необходимые инструменты для быстрого старта в UX/UI-дизайне, научитесь мыслить и действовать креативно и соберете портфолио, которое впечатлит работодателей.

• Вы узнаете, как разрабатывать цифровые продукты от идеи до готового макета, разберетесь в бизнес-требованиях, сможете проводить исследования и работать с гипотезами. А еще – находить клиентов и работать без офиса из любой точки мира.

Программа курса:
6 основных навыков, которые вы получите на курсе

Первый месяц
1. Figma, плагины, bootstrap сетка, side bar, auto layout
2. Cоздание landing page
3. Pабота на dashboard, прототипирование

Второй месяц
1. Базовые инструменты приложения
2. Изучение bootstrap сетки для мобильных устройств, Status bar
3. Работа над портфолио, Mockups, финальный проект"""
